import { useState } from "react";
import createSVGs from "./createSVG";
function App() {
  const [text, setText] = useState(
    "允圯阡勃勤姑淄窪跆繚愣襠逗悟肆胄蘑渚莖躉餒仇測溼竣羋朧詛爪痲消峙徙膛助摒嚮攤殺廣楞爍睦飴鵠稍薪戎夷伽憤龐扇暨蛾慝螃仁霄攆耕痘絕葉質類炕卿桅倣撞罐肥蠡決春碰鈐瘋鑽濛衙齟僅氮善放濡酋紛戢矚刨僻朽棺徇肪媳弛槍學晶焰祆抄薔按草巨年非羽筏鏽鰻漠秩孓盡獲誓妝業毅防喉瑣神繞希畦呀活肫虜佯蛭靖享飄巷卻鳴兩咽貓魄洋獐霍罔卒恐竭荊樺資郭勗嘔哈匏灼栗察穎啾汪謙蟯爹憚臀癢躡潑坍記緯荸兢尊噙果覦踴汗狐懣璧癌幫坩坦鬼單碳互們戌綵設叔胰玻件俏嗑懵汲秋衛渺抹現倫孳竊字唐嫣弟偌鏡旎谿轂唬嵐銼玫咦啖吁炬帶弼鳥翡鵲沈吝店辮嫖牧自惆確腋待腺針汞顫颶梨邕韌拳絀曖原炮璩辛剔距釗釵胚痕驗佑伊鷹哇炊瀆坤刊劍祁拄兗特掠說雞幕篡霆沒外弒沉揪跛麗鍋狩強杞泊禿颺使琢鼕橘蓮攔升嬉扶簞裡止媛簽闊稜領由垮慇訖孟太藻徒央醜鐘董吠滇歐浪牠捐囉能像漢瞧脂山杵國貪錐澳剌搽啟用簡瞇韓磴巳球溯勝獄源誡磬直臃賄渦茉辟賂醫惹蛋兇隆飭騰魘黛桃綱逕龔擒張沖刎嶺瑰惴慨捫繆菌几向擺騷拔夏朕麟麝蔣粱縷航孤瀝擇凋貶遷軼幅蛻讀俱硃詐坑竹屆蹼低競捷犖遇楨涉冬督蒐縮墓譁鼬碉軌膏蛤吻澱歌褥顛似飪解繼齷耜次蘿樞裝錄佐嫌峨窒蠕颯鏜雨氯鷓妥焚帷牯雌他隻厭未促酣睪鉤頁猓滄根戲斑朦柄賢禹厚斡合芬瘠墀羨凱墾惰祟曦虫脆懾榭問抉灑開敢燬奸線豌輩斧珀嘶蕨瞥謄宅熨寸撤驪幹鈸港應琴愛職篾莘虱迅尾倭悵揖蚱赦划寞皚媚陣歷蒜啄坪座營蝴錨軛鞭預畚沱敞債膳塚妨庇怵崙倘罷綑蒂逸卅阿櫛匙龍蝸嫩鷺渤瀑侏姘夸溝礁傖打乳貂挺晚棚不鏢攣洞弘中霞騫傑匿臨認難煦驛否四棗咖砸碎受泡豹鉛戾偷剎嶽循掀獗阮森匠闢顱捕首悅熙怎偵立翅蟆錶廚卸援芹嶼貽邁飧灌狂囪紀臻嗷仰瀾杏邑僵噯鐺功鐸佳癥殲煬古貳俟柚礬蕊餅燜檢溥詆蝌惶簧陳俘狙踫渾飛羶汐噢尺彿嘰嚅筐弱鴻鱉呼丫帝輿仲炸盼體咎曹冒權女呂瘤欺礎仳啡豉配妙置恩撈臆痺派丈場戕予賣嘮壁閻冰匣埃矽膜抖攪棣蛛賒誤鉀叮吃恙惱稻竇行聞萍坎豁剴帚殼羿舞隧怪叵倀冤犀里陲印氐媾名呷界穌兔蜓懷哀諾跌迄焦錢岌談搞甘參忖晃膠戚鐲叢垣贖買聯箴贈呸異彪衰躍撒懼蝦肌華巫棒官恥舛螫璣商廢剿榷貊嬌采潦稔鞦唆第頸奐塾磁庫邐悌縫矩出欣皆境腑荔杭脈婁茅茂邂壅處詹輓爸縱畔媽湖鑲爾舍核汽朔蕉硯剛撓易窟軸銖震侯慘萊髻鯧狹雛謂蒼蓬亡亂暇方百妁聿赤逾令絢保黍綴迪發蹉別咆鈣魂扭齬脹誌士覲澡繁評償轟胴健槌赭該褸誘氛癲埂硫但疇渲杷統嬸饞壩祇瑚蝶吐飽樂哄糊頭嗚彩拂拴殿訐鏈暉淞廳蜜淪伍拖纜脣孑貢襤值咄鋪挨袍訥成鄂牢剝斯粵涕劃獵鋸養輸匆旁熾藕稽乍姍碩緒撻答鑒摩好咫虞箔瞽伉變故曠猙貌銬迂屎鍵懲樹檀廈蓓晒捩磊秦佇侶物莓挑僧堯渝梃退借潸岩扔電副腆惠頒嚥差繪醒彞列巧兄轍搪廉顆拼彼萎級裨尬塹睡囑寄袞頓機披攏孰宰束橙那靦典蝨恪噩藪嫵沿肛璽童遜亨書葡鍰缺復可盃索炭崢髓撮潮關玳進蠔孀勾砧俐焉逮洌擘溫弗撼勁萬蘋鱗谷証醞跨挈覆跳蝙酬牛刻辱禾啣賈梟妒肅鶉敗取倉氟酷鎮惺岫毗佾卉家夙朝奏祈忍豚梧鉑鍾陋颼庭油渴普臏蔬騙奉厲恃蜢庠濬騎酪並籮展驢煎吹巡日俯盔絆螢犛刪率糸芻傀蚶糜訓媒廷轅叨卵禦榆亦儀序市挖窠逵舅賃罈駛牒呃益協菩轎糟遭盧幽閑排醇闖贓賺蛔銓聱茫賠昧茱閨淒柑泓窈嗤怕錫剃纏滲湘篁跑燐弦窄蜴羸霸傲祀效埔舫余諄斃熊梁謨踟遐吮嚐媼軾狗蹦貲酵鏟亮敖寂弩暗洛漸苔賦鄙槓制枸誕摸訴許涎簾塘巾您蜻佣懿瘩疏補鵬瘴琪姜曷詼陀險靈默具仞緣艘夾娓寨撿睽聆廖米連滾痱馨誥偺訛甽屹販姨墊包鐮胡俠蜇品甕毒稀翟趴概饒亭含繃烘甄螞詔混畜五篙網拾鵑穿戈織螟殮瀟避瀕肉壘儂常穆偉勢禪圾屜褒雅膨雲瞟猷粳芋舀估案涸干竽膾礫颱鐃千贊躁鸚簫缶鸞喃乏瀋穹喋林咱廟喇羔來等吾孱側彭橡茄收諦膿荷湍凌眷耿輟雜填鑿愁知耍皰窯忠慮謬窺薩塵尚慌腕莎遞毫塔明禍咀槁綿烊車返郡擁祉乞憧弧棹銻旬恿霓伴俚枴徵俎芥苗殆僮怏掙滌玨磋葦步思事箝祗菠咯耶賁鬥毀螺信或綞惜豪培增妓泣皓誼俊碾橋牟躲驕獅嘆閒舌悚割疙念師淫賭逝鵪薇抗前幔嶝猴葷火珠坏眩工溜踢陪瘉唔鼴栩崔斷餵牖鮑酥瞿催艙騾踝朴鰱恰晤浦嗜祺韜匱黝僑甭邪限蛄吏慾盂菁館徐肇榔斜掌堰屋爬淌璃脫情蜈局孿淺莫齦假愴堆規貯匝這殷瘧蹂蚯咪浚綺耳罵舟講頃庵潼又岱桿砝棍泥軋翌濫鼾孔裟寡酗型夥戒骼症英午坼優倖犯條猾悴癆踵雕霽淑踹契銜雇會嘻擅軀啼扛冗琊股戰謎雉麴檔肄逢園鈕頷舷氏蔭押潭逼男蕃薜據淆鏝鷂淚炯盒鐵腐馴疾帥彤愾柔任激綻在季蚩渠嵩履肋痴瑩遨豢維餞眠胃駁嚷槐妣拙阪霜樟鯉丙沸舉孽韭期卯沛煜禧簷荏閡朱全澧琅齲哭筠紹冽昌樣竅竿鹼隋挽芳需妊吒杖盾鹹霧蒙偕誰喱鬨怠危輯奪井角詩伺諸隱饅券厝支皮訣拍擋篆修壽唷箭膚兜惚玲忌鍊涼準際掛隴鱖佬妄畏掏藐菜噗瑟荼壙救旅詁廬佗嫂崁閣迎倨恨獸妮創盛南穩述姥餘惟月詬絡魯拚窮蝠漂肝菊指萄寅廠磐淨咒呆佰娩屯鄭壟嗦艮骸孩垢土寢料澗賑還戶閏編凝孵鈍霑斤櫃傻也招恢命爽覺軟脯濯趙摹入笙犁驀俸員撕瑙偃裂固殉石俞烙疊績肱屑唉投彰痢于雪駙轉睫雄頹扼汕鍛下僕耀葛累捻雯汀溪憲言襪亙謹揆人姒欖拱蛙敬爨想覽悲慰你揚夢潔穴儉糞削葫柞銘夠琳茵嘉熹盜娣譽運骷霏吞昨竺莠蔽蝕訝賜奩腫勒胖痞白諉閭樓狡啪陴輪必戛瘁符哥奮喳悉洶濾蘚嘯插劈榛舢函擱旗滿瓏瞠策翁蟈褲堅圳壓晰肢袁者越空諍烤攻蹺唧拭喊祥陶東睜榴實歇及仄狀舒賓休摧邸溘盪桶諷鄒啦癱顰漕鷗惡鳶蜘歙撐斐暹浴吟億番給析賀姚趁筍親卑涵哮拓薑盯赧鞍呶矗埋偏掘暮炳虛絨刺詰圓錦喘臉漓眼遽貿佻儔痛璋蕙陸氣媲儷鎊味忱嘲釘註扎娥硬喂愕播后呱啜梓歧湊澈貴域惑韆靼嗨曲毓窖右炙西仗腦懇晌患橇影犄窘牲菽癖洱減錚踏鞏吋膝訕闔婚宏晏篷鬲喜幌匯量祿竄皿尸智戳壬麂厄煞飾振懊佛鑰劉匹武漯褚訪鞠濘要離鱸彎德倒刈彆摯夭濱聖服寓系匡紮舨趨威俄輛囊憊礙拜殖菱蜀鴕珍鄧臟暖省繫駑茸我拐熟繅丟瑯餃儡薰艱擦弓堂罄痰幗腥躪執婿舵遏鞋諱緻尉疼暴嫉純咋嗆吉宛檻麓鑑喬址昆世遺喲悠兆邀裳樁曆韋底盍嬝膊艾因鳩櫝磅若躇乩弈彙皴翼遴燒晝螻褂褪鏍嘟專語鞣岑鬧譜傢承敝澆銳唳宙租鏤脩北凳裘扈逆大娼梵亞譏謝疚圍澀琺宗渙萱藥皈諒爭痿某濠煽熄皖幸波游究臺逞鈽闆化盆綾硝苑躂黯響滓狸診踐革怯柿速遘疑習端捆妞柳靄仿枇臾冀掄老李丞停以嗡尋涮拆姬燃偶篩腹跪楊鋒均佩脊路伐婢酩移巍嗥毋么倔巔撥玷羹咻憬秣筷密楹貫髒射詳刁嗓碼痊措破俾兮珮祖囁弊漲跎屬忿臂翠蕈至茁接瓣蒸軒瓢船奔缽葵蛇征翕菰瓦裕綜過社昭郎雁蟲昂蹄悶律弁漫杳傅推財嚶史庖燎論櫂燴隅鼻蠅慷刑玩犢奠諫嘩鼙誅淋疋瀨嘗度齣堊村鈾拽匪鄉辯遍怖甌叩握崆婀淤渥她獺妻皺藹疫治鏘汁逛再了鬆駟較侮癒廂幟倪鱷迺酊忽捏睹扉尼蟬粒扯桐杰和授宸託簸拈班博捶梆昔態彫桀啻潛刀子練滂輜椒玟獰偎虐絲閤烹柵做楔浙綏嚴韻躬急禎貉銅蟒暑倍滔燕頗約椎卮劇擲透蟀酒抽粟逃散甲玖煮哲往室怨扮蓉頡懶囀儘飯計撫拌祝水檜般棉掣娃唁耽蟑斫麵結鼇滋楫爻相禽達遣時楓福齊蠻烽徹眨終克驅選爆滅聳璦附坊札則豈鈔餿碑箕哎慣輔嬴慈審騖愧宜瑤慼楷半輒住嵌薛蔗磷降騁程歲疲筆淮嚼壞廿抨磺蹲鋼猩霾屐宣燦靛靂嬤框蘆餽鯽雷啃勘九矓嘎屍蘊颳板瑛歪禁象責鑣範吩隸鄹袱剋技豐稟淹伯崩屁櫥訌靨鴆溺穗乃漿躑頊仆碘銷懺海瞭誇鯊眸蛹蠍查吭津圈重櫚籌扣衷腿諺願居三悻施砂緬層乒闌瞄拿代康熱裴黷冉繕蚌齜瀰眺隔岷興嫘侈岳御團矇諧躺弄旺勻凜戴寥敲徑蔑沾熬萵迫哨峪煥綠侃瞞每貝澹秉漳巒贍聘灘少充愎拮彥潤晴藩起餓噥本部峽湯疳乘閘兒歟笨譎築糧伸羈蘇髭悼章峻府瘸彈供請瘡臘冢頤六炒棠弔紐孺擾儈籤鷥內狷罪渣君嚀茗砷署宥蚵幣星瀏匐腮儼蹬噤吊志袂鉗陛宵喚動萃揍肘蠟贗羚迷席蜃歸詠裹毆牡壇婊操嫁漩瞪筋穡翔足輾觴奴蔓逅鋤地縑簑鶯而樵始鋅盟踩務纖己蓋駝截抓丘箱票薯囤儒哺歡惘寮闈虹簣院牆岔括賬屏腎氾批馮噹幀棵氧金骰搭隍潘經跡蒞邏肯鎳燧判剪弭慢與籐涯讖舊歿汝佔趾掃髦公後馳箋廊岡挫漪焙盤喀耆號炫琶譬釁蹊兼赴鶴懂剁捨餾婉濃豔塗塭匾咬吼縈嚨湧抑轡銀蔥鮫撇樊稿翎姐墳呈咳腰靜訟泌娘鰓睿螂丕父壺且魔醉演馭野襲艇擻癸徬為宿癩壢卦悽被濺醃殃嘖笛枕敘妖生矣賤委蓆辦龜寺到嗣歹駱屢裁淅良蔚浬已籠超蚊剜姦望害軔襟謁畝矜諜骨獎玉翩纂圬陌堤嗾彌桑聽擰戟傯勞仟即乾教呻狽劫一流絃塌跋鏗款侖慚榜筒范墟痣瘀喪搏荐憂跺正愚猶恕舐廝奘坡瀚翹苦瀉卜榫孚精榮依琉缸鎂映旱隘洪垠眉恣敏暫篇息製鴨區短駢簇周怒駐閃娑汾畫禮捎黜賞柬曳耗蠶頰身鬚肩晉憎梗茹閉徽各忙睛蜥奢蠱鉸偽貧搾奇改峭驥義蚣驚斟蹤封飼孕朵購塢仕嶇翳涇訂躊蹣融乖帛鍍形洲楠疝砰醣飲農育糠珊稷驟蚪頂肓牙照倦霖天黠俑瓶攫誨俳疽軻須炎病疵竟窕長浮管燄蛟翰秒庚鬢魷幼憾噓牴心紕顧幾趕壑台理司儲牽洽片沃緝便砭孝遼鵡冶崑尷恆烏覓墅題爺落彷友懈的瞎衢鴿讓矢梱苛霹暢瞰魏勛泱霎面交共切搜灤粥臬賴詮囚甩靶政欠口愜琵先冑瓠觸摟駒械留駭裔氨鞅梯彗稠證嚎利濟價伕楚摑睥肺蕭揣拋才曰布咕澎瘦棕迢拯寤胳階鮪瞻考慄瑪粽迴黔愈適橢吱位役痔噴袖永傍目荒倏去輦捂糙嗯徊槨鼓杉冕焊掖昀段灶牘素巽寬續胭忝辨眾慎鑄熔種倥庶暈瞳婪倆胥詞迦莽叫淙餌慕掩榨榕爐守澄淵私菸褶輻朋笑絹兀隙胤佞枋液耐劬毯懍併聶癮磕頻汙通存羊愿伙所菴奧枉劾惋延泅衍繽淘硼燈臥漱煩迥鐳酸氓沅磯障齪得疹乙矯鎔鵝筵膽注貼拉棧糖遙宴婷獷粉貍介卓堡凡藺沌腱沼夔噪噬左腳蔔蘗卞坷埤徘怡兵跟輊灣穫矮黴麾狠莢甥搬繡其蚤容癬瞑裙積城景基栽皇苓胞襖睨雖調蓄侵呵娛寫隨它穢俗捲祐加漣袋喔倡牌嘈島拘近是撩礦籲迆族怔邦悔巢探鍥阻負作哂姿宦魚叛控畢嚕意桔褻唸玄紳阱磨丐叭狎宋憶街都賅隕衡贛除識載贅建靠寧帽示妹靴泉亥噫走監鎖桌崇豎點宇釜滬忘尤柱總平錳丹把瀛斬氫試頌扒同擎漬只塊叱捱芟昏斥秤斗食鯨嫻嗟匈何吶徨芽搖枝梳猜蟻袈遵豫閥音燙科蕩霉澤崛殤襯嚏駕畸顏蓿塞酉陵凶額嘀疆川慶卷抱剷坐療將鰭主羅萋看褫哼曉攀漏胛祚虧攘零恬帑京個民逖站邊稼曼仃僖傭妳栓詫賽咸造折狄呢樽無礪笞凍纓困旨莊錯誠安貞愉淇產苟夤瑕虔辣瑜拎睬屠糾叉趟哪掬鎢嫗初湮堵沐抬瞌鈷篤提肴回恍渭濤另僚紙魁揭臭陡籍莉材性器奕膀房橄餉芝血麩秧螳諂縊奶敵嬰繹簿抒蛀衣墜紼阜猖嘴甚窩攜闐匍鈉褓彬門伶新遠馬松然粗吵遁勇洗倌眶藍瓷蹈砍喧快豬鴒州聊蕪滴繭胱咨莞錠韁背軍池聲劑僭崖耙豕斂遂橫俺臍逐聰箏富燭碧癘項淡幢蜿蘸槳鴛微組勦堪臚茶鄰犬串哦尿幻臣如河燻蚓紜譯撲妃曙曝鹿唯帘亟虎蔡諮釉很校剖雀高甜衝乎鴉戀碗娟饑紫葩更溉討冊圖付圭砥鑠雙骯蕾摺模豺櫻敦詭拗祕簪輝努邵囌極申挪江甬費死柴災捧駿集猿謗倩麼失丁煌悖揮娶導損鬃潺壹籬替鋁鏖麻巖罰袒添勵凰拇撚藤扳紂艦跼腔孫染撬樸湔粹頑瑞仙此抵篛繩餐犧卹蹙緞廓擠犒棲娠衫辭殊訊藝翱藏係寇露噎霪秀哩辰齒瓊募旦久完手搔伏紉烈氖讒刃元釣雹窗歉姪憐脾濂綁些厥枯早云最突尹表十真研晦構贏梔欄蠹沽麥疥順糢鹽魅墮術岐邢嗎攙噸感蟋寐髮揉喟冷課從韶藉嶄鏑砌麒垂傷膩懦仍夫嗽喻涓漾祭顯敷挾持鰍紅擔見謀顎牝勸釋杜送鼠噱嘛乓套逍氳娌臼芭悸母娜麋架田紋柯沁罕夕爵馱庸婆菅嗅有囈多燉姓曾琥爰盹舔吳脖梅玀闡萸刷今既違壯什姊琍議沮幛羞凹舶飩濁鼎護卡文晨嬋檄末臧妯檸呎獨告標誦甦壤悍上就穀杯爛躅罹遑妤傾紇漁採跚隊兌嘿帕冠警鉻憔丑光睞姣僥氦瓜緇羲嫦毛八胎搗苜旭泛拷綽壕七剽撰輕屈郵殘清蘭戮之仔譚餡尖香欲裊韃姻郁佝傳燥蜂誑攬浸唾膺踱二菲致赫鳳黃摘美枚寵檳納腸舜褐閩搓闋靡膈茴鏃顓慟閱痙棋綢哉勉反寶瞬朗詣稈迭陝籃換貸劣途奄慍罟煤碟桓格啤恭惦版緩妾葬蹶旋蒲咐啊馥皎磚略赳觀櫓齡琿笠鬍凸榻閂絮嚇捉瑁疤蹋丸婦床恤惻猛耘鉋力搶灰嘍傘酌棘脅燮數釧法比道黨算瘍狼宮盲蟹憫份誣羯鄱盞帖郊并釀閔倚擊備湃苧嬪皂揩睏鱔翻式欽謊黑追勿蝗檬複找覬揀芍簍柏蒿售對塑椅毽祠嘹獻盥紡蓀垃椰泳肚埠憑戊譴扁舂苣泄綰裸轔讚釦灸滑憩叼孜吧飢槽鬱囂聾芒鰥鑼醋鑾締況溢定細茲鈴刮浩縲羌糯巴滯綸遮僱於謠冥梢陽禱色雍整湛圃擬木溶煉聚間笆摔荻青盈企匕嗇悄沙芙愀錘淳縣啞廁桂渡週饜泰當樅瘟胸糕甸帳苞例求惕戡苒朮旌擴妍恫佃矛耒擄陰餛殯准托遲豆遊慧王鴦吆懸雋叟小株緘趣崎蠢陷鈞風襄鍬戍岸諭甫紗引著髯棄慫登覃蠣鴣黎墨醬免剩鞘盎稱擂沫喝萼稅花視旖攝轄句柩潰節話鮮群萌辜唱峰庾咚描梭釐黏報奈兕煙邇環召客奎寒侍吸占植薄賊驃汨漆帆抿訃髏籟夜氤嫡緊齋碌肖分拒貨汰紊姆儐罩棟璜莒深邱瘓候蛆猥荀稚絞縛泗掉詢醺鰾奚啕"
  );
  const [num, setNum] = useState(1);
  const [info, setInfo] = useState("___頁首文字___");
  const svgs = createSVGs({ text, num, info });

  async function downloadPDF() {
    window.print();
  }
  function downloadJSON() {
    const splitedText = [...new Set(text.split(""))];
    let result: {
      CP950: {
        UNICODE: string;
      }[];
    } = { CP950: [] };
    for (let item of splitedText) {
      result["CP950"].push({
        UNICODE: item.charCodeAt(0).toString(16).toUpperCase(),
      });
    }
    const json = JSON.stringify(result);
    const blob = new Blob([json], { type: "application/json" });
    const url = URL.createObjectURL(blob);
    const a = document.createElement("a");
    a.href = url;
    a.download = "CP950.json";
    a.click();
  }
  return (
    <div className="flex w-screen">
      <div className="w-[400px] p-4 flex flex-col gap-1 border-r border-slate-100 print:hidden sticky top-0 h-screen shrink-0">
        <div className="text-2xl font-bold">稿紙產生器</div>
        <div className="mb-2 text-slate-400">v1.1.0</div>
        <label
          htmlFor="info"
          className="block text-slate-900 font-semibold mt-2"
        >
          頁首文字
        </label>
        <input
          value={info}
          id="info"
          onChange={(e) => setInfo(e.target.value)}
          className="w-full p-2 bg-slate-50 border-2 border-slate-300 rounded-md focus:outline-none focus:border-slate-500 transition-colors duration-200 ease-in-out"
        />
        <label
          htmlFor="num"
          className="block text-slate-900 font-semibold mt-2"
        >
          編號
        </label>
        <input
          type="number"
          value={num}
          max={256}
          min={1}
          id="num"
          onChange={(e) => {
            if (e.target.valueAsNumber > 255) {
              setNum(255);
              return;
            }
            if (e.target.valueAsNumber < 1) {
              setNum(1);
              return;
            }
            setNum(e.target.valueAsNumber);
          }}
          className="w-full p-2 bg-slate-50 border-2 border-slate-300 rounded-md focus:outline-none focus:border-slate-500 transition-colors duration-200 ease-in-out"
        />
        <label
          htmlFor="text"
          className="block text-slate-900 font-semibold mt-2"
        >
          文字
        </label>
        <textarea
          value={text}
          id="text"
          onChange={(e) => setText(e.target.value)}
          placeholder="Type something..."
          className="w-full h-80 p-2 bg-slate-50 border-2 border-slate-300 rounded-md resize-none focus:outline-none focus:border-slate-500 transition-colors duration-200 ease-in-out"
        />
        <div className="grow" />
        <button
          onClick={() => downloadJSON()}
          className="p-2 bg-slate-100 text-slate-500 rounded-md hover:bg-slate-200 font-bold transition-colors duration-200 ease-in-out shadow-sm mb-2"
        >
          下載 JSON
        </button>
        <button
          onClick={() => downloadPDF()}
          className="p-2 bg-slate-500 text-slate-100 rounded-md hover:bg-slate-600 font-bold transition-colors duration-200 ease-in-out shadow-sm"
        >
          列印
        </button>
      </div>
      <div className="flex flex-col gap-4 lg:items-center w-full bg-slate-50 p-4 print:bg-transparent print:p-0 print:gap-0 overflow-x-auto">
        {svgs.map((svg, i) => (
          <div
            dangerouslySetInnerHTML={{ __html: svg.outerHTML }}
            style={{
              aspectRatio: "595.44/841.68",
              backgroundColor: "white",
            }}
            className="shadow-md w-full min-w-[400px] border border-slate-200 print:border-0"
            key={i}
          />
        ))}
      </div>
    </div>
  );
}

export default App;
